Applying **stage**:
```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-lab-org-stage/runs/run-mfpSZQazuCiFwLGh

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 0s
module.app.data.digitalocean_domain.domain: Reading...
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-lab-org:stage]
module.app.digitalocean_droplet.droplet: Refreshing state... [id=400789423]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-lab-org:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=african-cities-lab-org:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:stage_traefik]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-lab-org:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:prod_traefik]
module.app.data.digitalocean_domain.domain: Read complete after 1s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-lab-org-stage]
module.app.digitalocean_record.a: Refreshing state... [id=1726056918]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-lab-org:stage:droplet_host]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=5c331857-e58d-4200-aa6f-d36d7ece134f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_droplet.droplet must be replaced
-/+ resource "digitalocean_droplet" "droplet" {
      ~ created_at           = "2024-02-12T10:06:30Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "400789423" -> (known after apply)
      ~ ipv4_address         = "167.99.135.90" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 2048 -> (known after apply)
        name                 = "african-cities-lab-org-stage"
      ~ price_hourly         = 0.01786 -> (known after apply)
      ~ price_monthly        = 12 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:400789423" -> (known after apply)
      ~ user_data            = "15237481697cc563af7b9f88e8ba68cea843339c" -> "01ec49bdbc73b0deeb5f64ab870bd64102b21484" # forces replacement
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "1c258bb0-6336-4320-95de-1fb9e3184054" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.app.digitalocean_project_resources.resources will be updated in-place
  ~ resource "digitalocean_project_resources" "resources" {
        id        = "5c331857-e58d-4200-aa6f-d36d7ece134f"
      ~ resources = [
          - "do:droplet:400789423",
          - "do:space:african-cities-lab-org-stage",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app.digitalocean_record.a will be updated in-place
  ~ resource "digitalocean_record" "a" {
        id       = "1726056918"
        name     = "staging"
      ~ value    = "167.99.135.90" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.droplet_host must be replaced
-/+ resource "github_actions_environment_secret" "droplet_host" {
      ~ created_at      = "2024-02-16 14:23:28 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:droplet_host" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-16 14:23:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ droplet_host = "167.99.135.90" -> (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with module.app.digitalocean_spaces_bucket.bucket,
│   on .terraform/modules/app/terraform/modules/app/digitalocean.tf line 17, in resource "digitalocean_spaces_bucket" "bucket":
│   17: resource "digitalocean_spaces_bucket" "bucket" {
│ 
│ Terraform will only perform drift detection if a configuration value is
│ provided. Use the resource `digitalocean_spaces_bucket_cors_configuration`
│ instead.
╵

```
```
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-lab-org-stage/runs/run-VE9GnuKRaBeKo4U7

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 1s
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-lab-org:stage]
module.app.data.digitalocean_domain.domain: Reading...
module.app.digitalocean_droplet.droplet: Refreshing state... [id=400789423]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-lab-org:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-lab-org:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:stage_traefik]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=african-cities-lab-org:stage:stage_django]
module.app.data.digitalocean_domain.domain: Read complete after 0s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-lab-org-stage]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-lab-org:stage:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=1726056918]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=5c331857-e58d-4200-aa6f-d36d7ece134f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_droplet.droplet must be replaced
-/+ resource "digitalocean_droplet" "droplet" {
      ~ created_at           = "2024-02-12T10:06:30Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "400789423" -> (known after apply)
      ~ ipv4_address         = "167.99.135.90" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 2048 -> (known after apply)
        name                 = "african-cities-lab-org-stage"
      ~ price_hourly         = 0.01786 -> (known after apply)
      ~ price_monthly        = 12 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:400789423" -> (known after apply)
      ~ user_data            = "15237481697cc563af7b9f88e8ba68cea843339c" -> "01ec49bdbc73b0deeb5f64ab870bd64102b21484" # forces replacement
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "1c258bb0-6336-4320-95de-1fb9e3184054" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.app.digitalocean_project_resources.resources will be updated in-place
  ~ resource "digitalocean_project_resources" "resources" {
        id        = "5c331857-e58d-4200-aa6f-d36d7ece134f"
      ~ resources = [
          - "do:droplet:400789423",
          - "do:space:african-cities-lab-org-stage",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app.digitalocean_record.a will be updated in-place
  ~ resource "digitalocean_record" "a" {
        id       = "1726056918"
        name     = "staging"
      ~ value    = "167.99.135.90" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.droplet_host must be replaced
-/+ resource "github_actions_environment_secret" "droplet_host" {
      ~ created_at      = "2024-02-16 14:23:28 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:droplet_host" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-16 14:23:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ droplet_host = "167.99.135.90" -> (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with module.app.digitalocean_spaces_bucket.bucket,
│   on .terraform/modules/app/terraform/modules/app/digitalocean.tf line 17, in resource "digitalocean_spaces_bucket" "bucket":
│   17: resource "digitalocean_spaces_bucket" "bucket" {
│ 
│ Terraform will only perform drift detection if a configuration value is
│ provided. Use the resource `digitalocean_spaces_bucket_cors_configuration`
│ instead.
╵

module.app.github_actions_environment_secret.droplet_host: Destroying... [id=african-cities-lab-org:stage:droplet_host]
module.app.github_actions_environment_secret.droplet_host: Destruction complete after 0s
module.app.digitalocean_droplet.droplet: Destroying... [id=400789423]
module.app.digitalocean_droplet.droplet: Still destroying... [id=400789423, 10s elapsed]
module.app.digitalocean_droplet.droplet: Still destroying... [id=400789423, 20s elapsed]
module.app.digitalocean_droplet.droplet: Destruction complete after 21s
module.app.digitalocean_droplet.droplet: Creating...
module.app.digitalocean_droplet.droplet: Still creating... [10s elapsed]
module.app.digitalocean_droplet.droplet: Still creating... [20s elapsed]
module.app.digitalocean_droplet.droplet: Still creating... [30s elapsed]
module.app.digitalocean_droplet.droplet: Still creating... [40s elapsed]
module.app.digitalocean_droplet.droplet: Creation complete after 43s [id=408938785]
module.app.github_actions_environment_secret.droplet_host: Creating...
module.app.digitalocean_project_resources.resources: Modifying... [id=5c331857-e58d-4200-aa6f-d36d7ece134f]
module.app.digitalocean_record.a: Modifying... [id=1726056918]
module.app.digitalocean_record.a: Modifications complete after 0s [id=1726056918]
module.app.github_actions_environment_secret.droplet_host: Creation complete after 2s [id=african-cities-lab-org:stage:droplet_host]
module.app.digitalocean_project_resources.resources: Modifications complete after 4s [id=5c331857-e58d-4200-aa6f-d36d7ece134f]

Apply complete! Resources: 2 added, 2 changed, 2 destroyed.

Outputs:

droplet_host = "165.227.138.207"

```